import React, { useState } from "react";
import { useNavigate } from "react-router-dom";
import { MobileLayout } from "../../../../../components/navbar/NavbarMobile";
import BackButton from "../../../../../components/mobile/button/BackButton";

export default function PrivacyPolicy() {
  const [loading, setLoading] = useState(false);
  const navigate = useNavigate();

  return (
    <MobileLayout loading={loading}>
      <div className="flex flex-col items-center w-full h-full">
        {/* Head Title */}
        <div className="w-full max-w-md py-4 flex justify-between items-center">
          <h2 className="text-[#009845] text-lg font-semibold sarabun-font">นโยบายความเป็นส่วนตัว</h2>
        </div>
        <div className="w-full max-w-md">

          <p className="sarabun-font text-sm text-[#978B87]">
            ความยินยอมในการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคล<br />
          <p>
            สมาชิกอดามา สไมล์ พลัสตกลงยินยอมให้ บริษัท อดามา (ประเทศไทย) จำกัด เข้าถึง เก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลซึ่งได้บันทึกและจัดเก็บอยู่ในบัตรประจำตัวประชาชนแบบอเนกประสงค์ (Smart Card) 
            หรือพาสปอร์ต (Passport) หรือเอกสารอื่นใดที่ออกโดยหน่วยงานราชการ และ/หรือที่บริษัทเก็บรวบรวมจากแหล่งอื่นหรือบุคคลอื่นใดภายใต้ข้อกำหนดและเงื่อนไขของกฎหมายที่บังคับใช้ในขณะนั้น 
            รวมถึงข้อมูลส่วนบุคคลอื่นใดของสมาชิก เช่น:
          </p>
          <ul class="list-decimal pl-5">
            <li>ชื่อ-นามสกุล</li>
            <li>หมายเลขบัตรประชาชน / หมายเลขพาสปอร์ต</li>
            <li>วันเดือนปีเกิด</li>
            <li>ที่อยู่</li>
            <li>หมายเลขโทรศัพท์</li>
            <li>รายการซื้อสินค้าหรือบริการ</li>
            <li>ข้อมูลจากการสอบถามหรือที่มีปฏิสัมพันธ์กับบริษัท เช่น ข้อคิดเห็น คำติชม คำถาม คำตอบ คำขอ ฯลฯ</li>
          </ul>

          <h3 class="font-semibold">ข้อมูลดังกล่าวสามารถนำไปใช้ตามวัตถุประสงค์ของบริษัทในการ:</h3>
          <ul class="list-disc pl-5">
            <li>พัฒนาประสิทธิภาพของสินค้าและบริการ</li>
            <li>จัดหรือทำการตลาดเกี่ยวกับสินค้า บริการ และสิทธิประโยชน์</li>
            <li>จัดกิจกรรมส่งเสริมการขาย</li>
            <li>จัดทำข้อมูลสถิติ</li>
            <li>ทำวิจัย วิเคราะห์ และสำรวจทางการตลาด</li>
            <li>นำเสนอสิทธิประโยชน์ใหม่ ๆ ให้แก่สมาชิก เป็นต้น</li>
          </ul>

          <h3 class="font-semibold">บริษัทจะประมวลผลข้อมูลดังกล่าวให้สอดคล้องกับวัตถุประสงค์และให้เกิดประโยชน์สูงสุดแก่สมาชิก โดยดำเนินการตามกฎหมายที่เกี่ยวข้อง</h3>

          <h3 class="font-semibold">การเปิดเผยข้อมูลต่อบุคคลภายนอก</h3>
          <p>บริษัทอาจเปิดเผยข้อมูลส่วนบุคคลต่อบริษัทในเครือของ บริษัท อดามา (ประเทศไทย) จำกัด หรือพันธมิตรทางธุรกิจที่เกี่ยวข้องกับการให้บริการสมาชิกอดามา สไมล์ พลัส
            โดยจะดำเนินการตามวัตถุประสงค์ที่ระบุไว้ข้างต้น และจะขอความยินยอมจากสมาชิกก่อนเปิดเผยข้อมูล โดยให้เป็นไปตามที่กฎหมายกำหนดโดยเคร่งครัด</p>

          <h3 class="font-semibold">การถอนความยินยอม</h3>
          <p>หากสมาชิกไม่ประสงค์ให้เปิดเผยข้อมูลส่วนบุคคล สามารถติดต่อแจ้งมายังบริษัทเพื่อขอถอนความยินยอมเมื่อใดก็ได้ โดยติดต่อผ่านช่องทางดังนี้:</p>
          <ul class="list-disc pl-5">
            <li>เจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล</li>
            <li>บริษัท อดามา (ประเทศไทย) จำกัด <br></br>
            127/33 อาคารปัญจธานี ทาวเวอร์ ชั้น 28 ถนนนนทรี แขวงช่องนนทรี เขตยานนาวา กรุงเทพฯ 10120<br></br>
            อีเมล: privacy@adama.co.th 
            โทรศัพท์: 02-6811979 
            </li>
          </ul>

          <h3 class="font-semibold">สมาชิกอดามา สไมล์ พลัส ตระหนักดีว่าการถอนความยินยอมในข้อนี้ อาจมีผลกระทบต่อการเป็นสมาชิกดังกล่าว</h3>
          <h3 class="font-semibold">ข้อสงวนสิทธิ์</h3>
          <p>บริษัทไม่มีเจตนาในการเก็บรวบรวม ใช้ หรือเปิดเผยข้อมูลส่วนบุคคลเพื่อเสนอขายสินค้าหรือบริการ หรือเสนอสิทธิประโยชน์ใด ๆ แก่สมาชิก หรือการติดตามพฤติกรรมของสมาชิกอันเป็นการละเมิดสิทธิส่วนบุคคล<br></br>
          หากมีกรณีพิพาทใดๆ ระหว่างบริษัทและสมาชิก ให้ตีความตามหนังสือฉบับนี้ซึ่งอยู่ภายใต้กฎหมายประเทศไทย</p>

          </p>
        </div>
        <BackButton />

      </div>
    </MobileLayout>
  );
}
