import React, { useState } from "react";
import { useNavigate } from "react-router-dom";
import { MobileLayout } from "../../../../../components/navbar/NavbarMobile";
import BackButton from "../../../../../components/mobile/button/BackButton";

export default function PrivacyPolicy() {
  const [loading, setLoading] = useState(false);
  const navigate = useNavigate();

  return (
    <MobileLayout loading={loading}>
      <div className="flex flex-col items-center w-full h-full">
        {/* Head Title */}
        <div className="w-full max-w-md py-4 flex justify-between items-center">
          <h2 className="text-[#009845] text-lg font-semibold sarabun-font">นโยบายความเป็นส่วนตัว</h2>
        </div>
        <div className="w-full max-w-md">

          <p className="sarabun-font text-sm text-[#978B87]">
            ข้อตกลงและเงื่อนไขของผู้ใช้งานระบบแต้มเอ็ม<br />
            ประเภทบุคคลทั่วไป
            โปรดอ่านข้อตกลงและเงื่อนไขการแลก และลุ้นรับของรางวัลใข้งานผ่านแอปพลิเคชันนี้ ("ข้อตกลงและเงื่อนไข") อย่างระมัดระวังเนื่องจากข้อตกลงและเงื่อนไขนี้ระบุถึงข้อมูลสำคัญเกี่ยวกับสิทธิและหน้าที่ต่าง ๆ ของท่าน รวมถึงข้อจำกัดและข้อยกเว้นต่าง ๆ ซึ่งมีผลในการทำธุรกรรมและกิจกรรมทั้งหมดบนแอปพลิเคชัน
            การที่ท่านสมัครใช้บริการ และ/หรือ ใช้บริการใดๆผ่านแอปพลิเคชัน Line Official แต้มเอ็ม โดยการเลือก "ตกลง" เพื่อยอมรับตามข้อตกลงและเงื่อนไขนี้ ถือว่าท่านได้รับทราบและรับรู้ถึงเนื้อหาของข้อตกลง และเงื่อนไขนี้โดยครบถ้วนสมบูรณ์แล้ว และตกลงที่จะถูกผูกพันโดยข้อตกลงและเงื่อนไขนี้ รวมถึงกฎระเบียบ และนโยบาย ที่อาจประกาศบนเว็บไซด์ และแอปพลิเคชัน ซึ่งอาจมีการแก้ไขได้เป็นครั้งคราวโดยไม่จำเป็นต้องแจ้งให้ทราบล่วง
            หน้า นอกจากนี้บริการบางอย่างที่เสนอให้ผู้ใช้บริการได้ใช้งาน
            ผ่านเว็บไซต์หรือโปรแกรมอาจอยู่ภายใต้ข้อตกลงและเงื่อนไขเฉพาะ
            เพิ่มเติม ซึ่งการใช้บริการของท่านจะต้องอยู่ภายใต้ข้อตกลงและเงื่อนไขเพิ่มเติมดังกล่าวด้วย โดยถือเป็นส่วนหนึ่งของข้อตกลงและเงื่อนไขนี้โดยการอ้างอิง นอกจากนี้ท่านตกลงว่าธุรกรรมอิเล็กทรอนิกส์/อินเทอร์เน็ต (Electronic/internet transactions) ที่ได้มีการประมวลผลและดำเนินการจนเสร็จสิ้นแล้วโดยผ่านทางเว็บไซต์หรือโปรแกรมนี้มีผลบังคับใช้ได้อย่างสมบูรณ์ตามกฎหมายและผูกพันคู่สัญญาตามพระราชบัญญัติว่าด้วยธุรกรรมทางอิเล็กทรอนิกส์ พุทธศักราช 2544 ของประเทศไทย<br />
            1. นิยามศัพท์<br />
            1.1 "สัญญา" (Agreement) หรือ "ข้อตกลงและเงื่อนไข" (Terms and Conditions) หมายถึงข้อตกลงและเงื่อนไขนี้
            1.2 "โฆษณา" (Advertising) หรือ "การโฆษณา" (Ads) หมายถึง โฆษณาที่สร้างโดยผู้สนับสนุนเพื่อส่งเสริมการขายหรือเพื่อกิจกรรมการตลาดต่างๆ ของสินค้าหรือบริการของผู้สนับสนุนโดยผ่านเว็บไซต์หรือ<br />
            1.3 "แอปพลิเคชัน แต้มเอ็ม" (แต้มเอ็ม) หมายถึง แอปพลิเคชันหรือแพลตฟอร์มที่ถูกสร้างขึ้นบนระบบปฏิบัติการแอนดรอยด์ (Android) ระบบปฏิบัติไอโอเอส (iOS) หรือระบบปฏิบัติการอื่นๆ ที่อาจพัฒนาขึ้นในอนาคต เป็นสื่อกลางให้ผู้สนับสนุนประกาศแคมเปญกิจกรรมการตลาดต่างๆ กำหนดสิทธิในการเข้าร่วมกิจกรรม (Participation Campaign) กำหนดเงื่อนไขและข้อกำหนด รวมถึงการโฆษณาต่างๆ ให้กับผู้ใช้งาน (User) ที่ยินยอมตกลงสมัครเป็นสมาชิก<br />
            1.4 "แคมเปญ" (Campaign) หมายถึง กิจกรรมส่งเสริมการตลาดที่ผู้สนับสนุนประกาศลงบนเว็บไซต์หรือ
          </p>
        </div>
        <BackButton />

      </div>
    </MobileLayout>
  );
}
